In [1]:
import pandas as pd
banking=pd.read_csv(r'C:\Users\Ngoc Anh\Downloads\banking_updated.csv')

In [2]:
banking.head()

,Unnamed: 0,cust_id,birth_date,Age,acct_amount,acct_currency,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,0,870A9281,09-06-62,58,63523.31,dollar,51295.0,30105.0,4138.0,1420.0,15632.0,02-09-18,22-02-19
1,1,166B05B0,16-12-62,58,38175.46,dollar,15050.0,4995.0,938.0,6696.0,2421.0,28-02-19,31-10-18
2,2,BFC13E88,12-09-90,34,59863.77,dollar,24567.0,10323.0,4590.0,8469.0,1185.0,25-04-18,02-04-18
3,3,F2158F66,03-11-85,35,84132.10,dollar,23712.0,3908.0,492.0,6482.0,12830.0,07-11-17,08-11-18
4,4,7A73F334,17-05-90,30,120512.00,euro,93230.0,12158.4,51281.0,13434.0,18383.0,14-05-18,19-07-18

In [3]:
#Question 1: Uniform the currency in acct_currency and acct_amount

#Print unique values in acct_currency
banking['acct_currency'].unique()

array(['dollar', 'euro'], dtype=object)

In [4]:
# Find values of acct_cur that are equal to 'euro'

acct_eu=banking['acct_currency']=='euro'

In [8]:
# Convert acct_amount where it is in euro to dollars
banking.loc[banking['acct_currency']=='euro','acct_amount']=banking['acct_amount']*1.1

In [9]:
# Unify acct_currency column by changing 'euro' values to 'dollar'
banking.loc[banking['acct_currency']=='euro','acct_currency']='dollar'

In [10]:
#check the result
banking[['acct_amount','acct_currency']]

    acct_amount acct_currency
0      63523.31        dollar
1      38175.46        dollar
2      59863.77        dollar
3      84132.10        dollar
4     145819.52        dollar
..          ...           ...
95     12209.84        dollar
96     92838.44        dollar
97     92750.87        dollar
98     41942.23        dollar
99     99490.61        dollar

[100 rows x 2 columns]

In [11]:
#Question 2: Uniform date format in account_opened
banking['account_opened']

0     02-09-18
1     28-02-19
2     25-04-18
3     07-11-17
4     14-05-18
        ...
95    26-05-18
96    04-05-17
97    16-08-17
98    09-10-17
99    01-08-17
Name: account_opened, Length: 100, dtype: object

In [18]:
#Convert account_opened into day-month-year format
import numpy as np
banking['account_opened'].dtype

dtype('O')

In [19]:
import datetime as dt

In [20]:
banking['account_opened']=pd.to_datetime(banking['account_opened'])

In [21]:
banking['account_opened']=banking['account_opened'].dt.strftime('%d-%m-%Y')

In [22]:
#Check the result
banking['account_opened']

0     09-02-2018
1     28-02-2019
2     25-04-2018
3     11-07-2017
4     14-05-2018
         ...
95    26-05-2018
96    05-04-2017
97    16-08-2017
98    10-09-2017
99    08-01-2017
Name: account_opened, Length: 100, dtype: object

In [23]:
#Question 3: Find the rows where the sum of all rows of fund_A,fund_B,fund_C,fund_D  are equal to the inv_amount column

# Store fund columns to sum against
fund_columns = ['fund_A', 'fund_B', 'fund_C', 'fund_D']

In [25]:
# Find rows where fund_columns row sum == inv_amount
inv_equ=banking[fund_columns].sum(axis=1)==banking['inv_amount']

In [28]:
# Store consistent and inconsistent data
consistent_data=banking[inv_equ]
inconsistent_data=banking[~inv_equ]

In [30]:
print(inconsistent_data)

    Unnamed: 0   cust_id birth_date  Age  acct_amount acct_currency  \
4            4  7A73F334   17-05-90   30    145819.52        dollar
11          11  DE0A0882   08-10-66   54     99998.35        dollar
12          12  EEBD980F   20-11-90   34     57838.49        dollar
19          19  DEB87C87   28-07-93   27     64944.62        dollar
22          22  96525DA6   23-11-92   28     82511.24        dollar
35          35  078C654F   17-10-93   27     87312.64        dollar
43          43  38B8CD9C   25-06-70   50     28834.71        dollar
44          44  D4C7E817   14-05-92   28     26585.87        dollar
45          45  7A4EED75   05-06-75   45     98923.14        dollar
47          47  68C55974   08-07-62   58     95038.14        dollar
53          53  82E87321   12-11-92   28     97833.54        dollar
58          58  A81D31B3   10-04-70   50     74010.15        dollar
65          65  0A9BA907   21-09-66   54     90469.53        dollar
69          69  E961CA44   26-02-92   28     27907.16        dollar
72          72  B25B3B8D   12-12-72   48     99193.98        dollar
89          89  C580AE41   01-06-68   52     96673.37        dollar
92          92  A07D5C92   20-09-90   30     99577.36        dollar
99          99  AC91D689   18-05-93   27     99490.61        dollar

    inv_amount    fund_A    fund_B    fund_C    fund_D account_opened  \
4      93230.0  12158.40  51281.00  13434.00  18383.00     14-05-2018
11     24567.0   2156.00   2891.00   4476.00   9144.00     06-05-2017
12     50812.0  18314.00   1477.00  29049.48   5539.00     12-08-2018
19         NaN  11828.00  13372.00   1039.00   5562.00     20-03-2018
22     24567.0   8206.00  15019.00   5559.60   6182.00     23-07-2018
35         NaN   3684.00  17635.00  11717.00  33493.00     14-04-2017
43     27531.0    314.00   6072.28  14163.00   7908.00     17-09-2018
44         NaN   9109.00   6706.00   2343.00   2282.00     05-06-2018
45     24567.0  10107.00    393.00    423.00  10008.00     28-11-2017
47     66796.0  33764.00   5042.00  10659.00  19237.41     04-03-2018
53         NaN  25595.00   7987.00  14098.00  13801.00     18-10-2018
58     24567.0  23761.00   4039.00  15610.00   5375.00     06-02-2018
65     70171.0  28615.00  21720.05  11906.00  10763.00     15-06-2018
69         NaN    995.00   3491.00   5476.00   1004.00     23-10-2017
72     24567.0  26237.00  21745.00  18440.00  16940.00     28-04-2018
89     68466.0   8489.36  28592.00   2439.00  30419.00     28-09-2018
92     60407.0   6467.00  20861.00   9861.00  26004.16     17-11-2017
99         NaN   2184.00  17918.00   6714.00   5333.00     08-01-2017

   last_transaction
4          19-07-18
11         15-01-19
12         04-01-20
19         15-11-19
22         07-08-18
35         05-08-18
43         05-02-20
44         08-12-18
45         01-05-19
47         25-09-18
53         21-07-18
58         12-09-18
65         28-08-18
69         11-07-19
72         04-07-19
89         17-09-18
92         16-01-20
99         04-08-19

In [31]:
#Question 4: Find the rows which contains missing value in banking dataframe
# Print number of missing values in banking
print(banking.isna().sum())

Unnamed: 0          0
cust_id             0
birth_date          0
Age                 0
acct_amount         0
acct_currency       0
inv_amount          6
fund_A              0
fund_B              0
fund_C              0
fund_D              0
account_opened      0
last_transaction    0
dtype: int64

In [36]:
# Isolate missing and non missing values of inv_amount
missingdata=banking[banking['inv_amount'].isna()]
non_missingdata=banking[~banking['inv_amount'].isna()]

In [37]:
print(non_missingdata)

    Unnamed: 0   cust_id birth_date  Age  acct_amount acct_currency  \
0            0  870A9281   09-06-62   58     63523.31        dollar
1            1  166B05B0   16-12-62   58     38175.46        dollar
2            2  BFC13E88   12-09-90   34     59863.77        dollar
3            3  F2158F66   03-11-85   35     84132.10        dollar
4            4  7A73F334   17-05-90   30    145819.52        dollar
..         ...       ...        ...  ...          ...           ...
94          94  A731C34E   03-06-61   59     95352.02        dollar
95          95  CA507BA1   10-08-74   33     12209.84        dollar
96          96  B99CD662   12-12-89   31     92838.44        dollar
97          97  13770971   29-11-84   36     92750.87        dollar
98          98  93E78DA3   14-12-69   51     41942.23        dollar

    inv_amount   fund_A   fund_B   fund_C   fund_D account_opened  \
0      51295.0  30105.0   4138.0   1420.0  15632.0     09-02-2018
1      15050.0   4995.0    938.0   6696.0   2421.0     28-02-2019
2      24567.0  10323.0   4590.0   8469.0   1185.0     25-04-2018
3      23712.0   3908.0    492.0   6482.0  12830.0     11-07-2017
4      93230.0  12158.4  51281.0  13434.0  18383.0     14-05-2018
..         ...      ...      ...      ...      ...            ...
94     84065.0  12061.0  15742.0  35725.0  20537.0     13-11-2017
95      7515.0    190.0    931.0   1451.0   4943.0     26-05-2018
96     49089.0   2453.0   7892.0  31486.0   7258.0     05-04-2017
97     27962.0   3352.0   7547.0   8486.0   8577.0     16-08-2017
98     29662.0   1758.0  11174.0  11650.0   5080.0     10-09-2017

   last_transaction
0          22-02-19
1          31-10-18
2          02-04-18
3          08-11-18
4          19-07-18
..              ...
94         13-01-19
95         11-09-19
96         12-03-19
97         24-04-19
98         15-04-18

[94 rows x 13 columns]